import { Quiz } from '../quiz.models';

export const QUIZ_TEST: Quiz = {
  questions: [
    {
      questionText: 'Кто считается самым умным человеком в мире?',
      answers: [
        'Никола Тесла',
        'Альберт Эйнштейн',
        'Стивен Хокинг',
        'Джейсон Байер',
      ],
      rightAnswer: 1,
    },
    {
      questionText: 'Какой из этих людей был признан самым умным в мире?',
      answers: [
        'Никола Тесла',
        'Альберт Эйнштейн',
        'Стивен Хокинг',
        'Джейсон Байер',
      ],
      rightAnswer: 1,
    },
    {
      questionText: 'Какой из этих людей имеет наивысший IQ?',
      answers: [
        'Никола Тесла',
        'Альберт Эйнштейн',
        'Стивен Хокинг',
        'Джейсон Байер',
      ],
      rightAnswer: 2,
    },
    {
      questionText:
        "Кто из этих людей был признан самым умным в мире по версии журнала 'Time'?",
      answers: [
        'Никола Тесла',
        'Альберт Эйнштейн',
        'Стивен Хокинг',
        'Джейсон Байер',
      ],
      rightAnswer: 1,
    },
    {
      questionText: 'Какой из этих людей имеет наивысший показатель ИКС?',
      answers: [
        'Никола Тесла',
        'Альберт Эйнштейн',
        'Стивен Хокинг',
        'Джейсон Байер',
      ],
      rightAnswer: 2,
    },
    {
      questionText: 'Кто из этих людей имеет наивысший показатель IQ?',
      answers: [
        'Никола Тесла',
        'Альберт Эйнштейн',
        'Стивен Хокинг',
        'Джейсон Байер',
      ],
      rightAnswer: 2,
    },
    {
      questionText:
        "Кто из этих людей был признан самым умным в мире по версии журнала 'Forbes'?",
      answers: [
        'Никола Тесла',
        'Альберт Эйнштейн',
        'Стивен Хокинг',
        'Джейсон Байер',
      ],
      rightAnswer: 2,
    },
    {
      questionText: 'Кто из этих людей имеет наивысший показатель ИКС?',
      answers: [
        'Никола Тесла',
        'Альберт Эйнштейн',
        'Стивен Хокинг',
        'Джейсон Байер',
      ],
      rightAnswer: 2,
    },
    {
      questionText:
        "Кто из этих людей был признан самым умным в мире по версии журнала 'Business Insider'?",
      answers: [
        'Никола Тесла',
        'Альберт Эйнштейн',
        'Стивен Хокинг',
        'Джейсон Байер',
      ],
      rightAnswer: 2,
    },
    {
      questionText: 'Кто из этих людей имеет наивысший показатель IQ?',
      answers: [
        'Никола Тесла',
        'Альберт Эйнштейн',
        'Стивен Хокинг',
        'Джейсон Байер',
      ],
      rightAnswer: 2,
    },
  ],
  requestText: '',
};
